# lets start with the basics of making Dataframes without read

The first part is really to start with list let's say that we have a list of employees names and salary and their ages

In [1]:
import random 
import pandas as pd

In [2]:
?random.randint

Signature: random.randint(a, b)
Docstring:
Return random integer in range [a, b], including both end points.

File:      ~/miniforge3/envs/new_ml_practice/lib/python3.11/random.py
Type:      method

In [3]:
names = ["Thomas","James","Saru","Tonde","Tarisai"]
ages, salary = [ random.randint(0,100) for i in range(len(names))], [ f"${random.randint(0,10000):.2f}" for i in range(len(names))]

In [4]:
list(zip(names,ages,salary))

[('Thomas', 82, '$2335.00'),
 ('James', 52, '$9102.00'),
 ('Saru', 84, '$628.00'),
 ('Tonde', 88, '$9012.00'),
 ('Tarisai', 48, '$2050.00')]

In [5]:
# You need this structure for multiple columns > 2 : [('Thomas', 33, '$6877.00'),
#                                                     ('James', 52, '$7075.00'),
#                                                     ('Saru', 87, '$5693.00'),
#                                                     ('Tonde', 73, '$7735.00'),
#                                                     ('Tarisai', 11, '$5486.00')]

pd.DataFrame(zip(names,ages,salary), columns=["names","ages","salarly"])

     names  ages   salarly
0   Thomas    82  $2335.00
1    James    52  $9102.00
2     Saru    84   $628.00
3    Tonde    88  $9012.00
4  Tarisai    48  $2050.00

In [6]:
# You don't require list(zip(**)) with pandas 
#  pd.DataFrame(zip(names,ages), columns=["naems","ages"])

#  pd.DataFrame(names,ages, columns=["naems","ages"]) # this is an error because it assume first colum to be the index 
pd.DataFrame(names,ages, columns=["ages"])

       ages
82   Thomas
52    James
84     Saru
88    Tonde
48  Tarisai

let's create a pd.DataFrame using list

let's create a zip file that will turn into a list instead of tuples

In [7]:
list(map(lambda x: list(x), zip(names,ages,salary)))

[['Thomas', 82, '$2335.00'],
 ['James', 52, '$9102.00'],
 ['Saru', 84, '$628.00'],
 ['Tonde', 88, '$9012.00'],
 ['Tarisai', 48, '$2050.00']]

In [8]:
pd.DataFrame(map(lambda x: list(x), zip(names,ages,salary)),columns=["names","ages","salary"])

     names  ages    salary
0   Thomas    82  $2335.00
1    James    52  $9102.00
2     Saru    84   $628.00
3    Tonde    88  $9012.00
4  Tarisai    48  $2050.00

another way is to create a dictionary

In [9]:
pd.DataFrame({"names" : names,"ages" : ages,"salary" : salary})

     names  ages    salary
0   Thomas    82  $2335.00
1    James    52  $9102.00
2     Saru    84   $628.00
3    Tonde    88  $9012.00
4  Tarisai    48  $2050.00

In [10]:
tuple(map(lambda x: tuple(x), zip(names,ages,salary)))

(('Thomas', 82, '$2335.00'),
 ('James', 52, '$9102.00'),
 ('Saru', 84, '$628.00'),
 ('Tonde', 88, '$9012.00'),
 ('Tarisai', 48, '$2050.00'))

In [11]:
pd.DataFrame(tuple(map(lambda x: tuple(x), zip(names,ages,salary))))

         0   1         2
0   Thomas  82  $2335.00
1    James  52  $9102.00
2     Saru  84   $628.00
3    Tonde  88  $9012.00
4  Tarisai  48  $2050.00

In [12]:
tuple(map(lambda x: list(x), zip(names,ages,salary)))

(['Thomas', 82, '$2335.00'],
 ['James', 52, '$9102.00'],
 ['Saru', 84, '$628.00'],
 ['Tonde', 88, '$9012.00'],
 ['Tarisai', 48, '$2050.00'])

In [13]:
pd.DataFrame(tuple(map(lambda x: list(x), zip(names,ages,salary))))

         0   1         2
0   Thomas  82  $2335.00
1    James  52  $9102.00
2     Saru  84   $628.00
3    Tonde  88  $9012.00
4  Tarisai  48  $2050.00

Main conclusion it just want's the stack role wise meaning all the information is collect for the entire role at once for all columns it must be linear